damellis/attiny/attiny/boards.txt
attiny13.name=ATtiny13 (internal 1.2 MHz clock)
attiny13.bootloader.low_fuses=0x6a
attiny13.bootloader.high_fuses=0xff
attiny13.upload.maximum_size=1024
attiny13.build.mcu=attiny13
attiny13.build.f_cpu=1000000L
attiny13.build.core=arduino:arduino
attiny13.build.variant=tiny8

attiny13.name=ATtiny13 (internal 9.6 MHz clock)
attiny13.bootloader.low_fuses=0x7a
attiny13.bootloader.high_fuses=0xff
attiny13.upload.maximum_size=1024
attiny13.build.mcu=attiny13
attiny13.build.f_cpu=9600000L
attiny13.build.core=arduino:arduino
attiny13.build.variant=tiny8


attiny45.name=ATtiny45 (internal 1 MHz clock)
attiny45.bootloader.low_fuses=0x62
attiny45.bootloader.high_fuses=0xdf
attiny45.bootloader.extended_fuses=0xff
attiny45.upload.maximum_size=4096
attiny45.build.mcu=attiny45
attiny45.build.f_cpu=1000000L
attiny45.build.core=arduino:arduino
attiny45.build.variant=tiny8

attiny45-8.name=ATtiny45 (internal 8 MHz clock)
attiny45-8.bootloader.low_fuses=0xe2
attiny45-8.bootloader.high_fuses=0xdf
attiny45-8.bootloader.extended_fuses=0xff
attiny45-8.upload.maximum_size=4096
attiny45-8.build.mcu=attiny45
attiny45-8.build.f_cpu=8000000L
attiny45-8.build.core=arduino:arduino
attiny45-8.build.variant=tiny8

attiny45-20.name=ATtiny45 (external 20 MHz clock)
attiny45-20.bootloader.low_fuses=0xfe
attiny45-20.bootloader.high_fuses=0xdf
attiny45-20.bootloader.extended_fuses=0xff
attiny45-20.upload.maximum_size=4096
attiny45-20.build.mcu=attiny45
attiny45-20.build.f_cpu=20000000L
attiny45-20.build.core=arduino:arduino
attiny45-20.build.variant=tiny8

attiny85.name=ATtiny85 (internal 1 MHz clock)
attiny85.bootloader.low_fuses=0x62
attiny85.bootloader.high_fuses=0xdf
attiny85.bootloader.extended_fuses=0xff
attiny85.upload.maximum_size=8192
attiny85.build.mcu=attiny85
attiny85.build.f_cpu=1000000L
attiny85.build.core=arduino:arduino
attiny85.build.variant=tiny8

attiny85-8.name=ATtiny85 (internal 8 MHz clock)
attiny85-8.bootloader.low_fuses=0xe2
attiny85-8.bootloader.high_fuses=0xdf
attiny85-8.bootloader.extended_fuses=0xff
attiny85-8.upload.maximum_size=8192
attiny85-8.build.mcu=attiny85
attiny85-8.build.f_cpu=8000000L
attiny85-8.build.core=arduino:arduino
attiny85-8.build.variant=tiny8

attiny85-20.name=ATtiny85 (external 20 MHz clock)
attiny85-20.bootloader.low_fuses=0xfe
attiny85-20.bootloader.high_fuses=0xdf
attiny85-20.bootloader.extended_fuses=0xff
attiny85-20.upload.maximum_size=8192
attiny85-20.build.mcu=attiny85
attiny85-20.build.f_cpu=20000000L
attiny85-20.build.core=arduino:arduino
attiny85-20.build.variant=tiny8

attiny44.name=ATtiny44 (internal 1 MHz clock)
attiny44.bootloader.low_fuses=0x62
attiny44.bootloader.high_fuses=0xdf
attiny44.bootloader.extended_fuses=0xff
attiny44.upload.maximum_size=4096
attiny44.build.mcu=attiny44
attiny44.build.f_cpu=1000000L
attiny44.build.core=arduino:arduino
attiny44.build.variant=tiny14

attiny44-8.name=ATtiny44 (internal 8 MHz clock)
attiny44-8.bootloader.low_fuses=0xe2
attiny44-8.bootloader.high_fuses=0xdf
attiny44-8.bootloader.extended_fuses=0xff
attiny44-8.upload.maximum_size=4096
attiny44-8.build.mcu=attiny44
attiny44-8.build.f_cpu=8000000L
attiny44-8.build.core=arduino:arduino
attiny44-8.build.variant=tiny14

attiny44-20.name=ATtiny44 (external 20 MHz clock)
attiny44-20.bootloader.low_fuses=0xfe
attiny44-20.bootloader.high_fuses=0xdf
attiny44-20.bootloader.extended_fuses=0xff
attiny44-20.upload.maximum_size=4096
attiny44-20.build.mcu=attiny44
attiny44-20.build.f_cpu=20000000L
attiny44-20.build.core=arduino:arduino
attiny44-20.build.variant=tiny14

attiny84.name=ATtiny84 (internal 1 MHz clock)
attiny84.bootloader.low_fuses=0x62
attiny84.bootloader.high_fuses=0xdf
attiny84.bootloader.extended_fuses=0xff
attiny84.upload.maximum_size=8192
attiny84.build.mcu=attiny84
attiny84.build.f_cpu=1000000L
attiny84.build.core=arduino:arduino
attiny84.build.variant=tiny14

attiny84-8.name=ATtiny84 (internal 8 MHz clock)
attiny84-8.bootloader.low_fuses=0xe2
attiny84-8.bootloader.high_fuses=0xdf
attiny84-8.bootloader.extended_fuses=0xff
attiny84-8.upload.maximum_size=8192
attiny84-8.build.mcu=attiny84
attiny84-8.build.f_cpu=8000000L
attiny84-8.build.core=arduino:arduino
attiny84-8.build.variant=tiny14

attiny84-20.name=ATtiny84 (external 20 MHz clock)
attiny84-20.bootloader.low_fuses=0xfe
attiny84-20.bootloader.high_fuses=0xdf
attiny84-20.bootloader.extended_fuses=0xff
attiny84-20.upload.maximum_size=8192
attiny84-20.build.mcu=attiny84
attiny84-20.build.f_cpu=20000000L
attiny84-20.build.core=arduino:arduino
attiny84-20.build.variant=tiny14


attiny2313.name=ATtiny2313 (internal 1 MHz clock)
attiny2313.bootloader.low_fuses=0x62
attiny2313.bootloader.high_fuses=0xdf
attiny2313.bootloader.extended_fuses=0xff
attiny2313.upload.maximum_size=2048
attiny2313.build.mcu=attiny2313
attiny2313.build.f_cpu=1000000L
attiny2313.build.core=arduino:arduino
attiny2313.build.variant=tiny20x13

attiny4313.name=ATtiny4313 (internal 1 MHz clock)
attiny4313.bootloader.low_fuses=0x62
attiny4313.bootloader.high_fuses=0xdf
attiny4313.bootloader.extended_fuses=0xff
attiny4313.upload.maximum_size=4096
attiny4313.build.mcu=attiny2313
attiny4313.build.f_cpu=1000000L
attiny4313.build.core=arduino:arduino
attiny4313.build.variant=tiny20x13


attiny87.name=ATtiny87 (internal 1 MHz clock)
attiny87.bootloader.low_fuses=0x62
attiny87.bootloader.high_fuses=0xdf
attiny87.bootloader.extended_fuses=0xff
attiny87.upload.maximum_size=8192
attiny87.build.mcu=attiny87
attiny87.build.f_cpu=1000000L
attiny87.build.core=arduino:arduino
attiny87.build.variant=tiny20x7

attiny167.name=ATtiny167 (internal 1 MHz clock)
attiny167.bootloader.low_fuses=0x62
attiny167.bootloader.high_fuses=0xdf
attiny167.bootloader.extended_fuses=0xff
attiny167.upload.maximum_size=16384
attiny167.build.mcu=attiny167
attiny167.build.f_cpu=1000000L
attiny167.build.core=arduino:arduino
attiny167.build.variant=tiny20x7


attiny461.name=ATtiny461 (internal 1 MHz clock)
attiny461.bootloader.low_fuses=0x62
attiny461.bootloader.high_fuses=0xdf
attiny461.bootloader.extended_fuses=0xff
attiny461.upload.maximum_size=4096
attiny461.build.mcu=attiny461
attiny461.build.f_cpu=1000000L
attiny461.build.core=arduino:arduino
attiny461.build.variant=tiny20x61

attiny861.name=ATtiny861 (internal 1 MHz clock)
attiny861.bootloader.low_fuses=0x62
attiny861.bootloader.high_fuses=0xdf
attiny861.bootloader.extended_fuses=0xff
attiny861.upload.maximum_size=8192
attiny861.build.mcu=attiny861
attiny861.build.f_cpu=1000000L
attiny861.build.core=arduino:arduino
attiny861.build.variant=tiny20x61


